Revit 2027 API
RebarFreeFormAccessor.FreeFormSetOrientationOptions Property
 Identifies the orientation options for an Aligned or 3D Path Free Form Rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FreeFormSetOrientationOptions FreeFormSetOrientationOptions { get; set; }
Public Property FreeFormSetOrientationOptions As FreeFormSetOrientationOptions
	Get
	Set
public:
property FreeFormSetOrientationOptions FreeFormSetOrientationOptions {
	FreeFormSetOrientationOptions get ();
	void set (FreeFormSetOrientationOptions value);
}
member FreeFormSetOrientationOptions : FreeFormSetOrientationOptions with get, set
Property Value
FreeFormSetOrientationOptions
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar is not created with the Aligned or 3D Path Free Form rebar server.
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace